##**BIOS基本功能**
**Bios的基本功能分为三部分:**

1. **自检及初始化** 
 *  自检（Power On Self Te s t，P O S T）:微机接通电源后，系统将对内部各个设备进行检查（ P O S T）自检中如发现有错误，将按两种情况处理：对于严重故障(致命性故障)则停机，此时由于各种初始化操作还没完成，不能给出任何提示或信号；自检中若发现问题，系统将给出提示信息或鸣笛警告，等待用户处理。
 * 初始化 (创建中断向量，设置寄存器) : B I O S设置的很重要的一部分主要是对硬件设置的一些参数。当计算机启动时会读取这些参数，并和实际硬件设置进行比较，如果不符合，则会影响系统的启动甚至正常运转。
 * 启动自举程序  :完成P O S T与初始化后，ROM BIOS将按照系统C M O S设置中的启
动顺序搜寻软硬盘驱动器及C D - R O M、网络服务器等有效的启动驱动器，读入操作系统引导记录，然后将系统控制权交给引导记录，由引导记录完成系统的启动。如果没有找到引导记录，
则会在显示器上显示“没有引导设备”。在计算机启动成功后， B I O S的这部分任务就完成了。
2. **程序服务处理和硬件中断处理**
 * 程序服务处理 ：程序服务处理程序主要是为应用程序和操作系统服务，这些服务主要与输入输出设备有关，例如读磁盘、文件输出到打印机等。为了完成这些操作， B I O S必须直接与计算机的I／O设备打交道。它通过端口发出命令，向各种外部设备传送数据以及从各种外设接收数据，使程序能够脱离具体的硬件操作，而硬件中断处理则分别处理P C机硬件的需求，因此这两部分分别为软件和硬件服务，组合到一起，使计算机系统正常运行。
 * 硬件中断处理 :B I O S中断服务程序是微机系统软、硬件之间的一个可编程接口，用于实现程序软件功能与微机硬件的连接。D O S / Wi n d o w s操作系统对软、硬盘、光驱与键盘、显示器等外围设备的管理即建立在B I O S的基础上，程序员也可以通过对中断的访问直接调用B I O S中断例程。
3. **BIOS设置**
 * 系统的硬件配置和用户对某些参数的设定信息保存在C M O S中。**C M O S** 本身只是一块存储器，只有数据存储功能，而对C M O S中各项参数的设定要通过专门的程序。早期的C M O S设置程序驻留在软盘上（如I B M的P C / AT机型），使用很不方便。现在多数厂家将C M O S设置程序做到B I O S芯片中，用户在开机时通过特定的按键就可进入C M O S设置程序，可方便地对系统进行设置，因此C M O S设置又称为B I O S设置。
 
##**BIOS与C M O S的区别：**
 * BIOS（Basic Input/Output System）英文字面直译是基础输入输出系统，它其实是一段固件（firmware～一类特殊的底层软件）程序，主要是用于PC个人电脑启动过程中的硬件参数初始化以及给OS操作系统和应用程序运行时提供特殊的中断服务。
 * CMOS含义，是互补型金属氧化物半导体的缩写，代表的是一种半导体生产制造工艺技术，也可表示和该工艺密切相关的晶体管器件电路，与之对应的电路有TTL、pMOS、nMOS等。
 **BIOS本质上是软件代码，CMOS则是半导体工艺或者电路，两者根本不是一个维度的概念**
